# list of all brew packages and casks

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Binaries
brew "ack"
brew 'grep'
brew "git"

# Development
brew "gcc"
# brew "llvm"
# brew "python@3.8"

# Shell
brew "shellcheck"
brew "tmux"
brew "vim"
brew "wget"
brew "zsh"

# Apps
cask "alacritty"
cask "cloudflare-warp"
cask "discord"
cask "google-chrome"
cask "itsycal"
cask "obsidian"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"

# Fonts
cask "font-hack-nerd-font"
